test2/Case2/system/controlDict
FoamFile
{
    version 2.0;
    format  ascii;
    class   dictionary;
    object  controlDict;
}

application     coatingPhaseFieldFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         0.1;

deltaT          1e-6; //1e-4
adjustTimeStep  no;

writeControl    runTime;  
writeInterval   0.001;

writeFormat      ascii;
//writeFormat     binary;
writeCompression off;
purgeWrite      0;