test2/Case2/0/fi.org
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      fi;
}
dimensions      [0 0 0 0 0 0 0];
internalField   uniform 0; 
boundaryField
{
    borders
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}