test2/Case2/system/constant/transportProperties
FoamFile
{
    version 2.0;
    format  ascii;
    class   dictionary;
    object  transportProperties;
}

rho1 rho1 [1 -3 0 0 0 0 0] 1.2;      // air
rho2 rho2 [1 -3 0 0 0 0 0] 950;      // photoresist
mu1 mu1 [1 -1 -1 0 0 0 0] 1.8e-5;   // air
mu2 mu2 [1 -1 -1 0 0 0 0] 1.86;     // photoresist

epsilon epsilon [0 1 0 0 0 0 0] 1e-4;  // interface thickness
sigma sigma [1 0 -2 0 0 0 0] 0.0215;  // surface tension
chi chi [-1 1 1 0 0 0 0] 1.0;   // mobility   